Revit 2024 API
BuiltInFailures.MechanicalFailures.PanelValidateConfigurationError Property
 More than one circuit falls onto the same slot. Disconnect the circuits from the panel?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PanelValidateConfigurationError { get; }
Visual Basic
Public Shared ReadOnly Property PanelValidateConfigurationError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PanelValidateConfigurationError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace